In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
from sklearn.decomposition import PCA
from sklearn.preprocessing import StandardScaler
import time

# Train Dataset

In [2]:
pd.options.display.max_columns = None
pd.options.display.max_rows = None

In [3]:
# Load Dataset
application_train = pd.read_csv("D:/Code Skripsi - RL and Ensemble/data/raw/home-credit-default-risk/application_train.csv")
bureau = pd.read_csv("D:/Code Skripsi - RL and Ensemble/data/raw/home-credit-default-risk/bureau.csv")
bureau_balance = pd.read_csv("D:/Code Skripsi - RL and Ensemble/data/raw/home-credit-default-risk/bureau_balance.csv")
previous_application = pd.read_csv("D:/Code Skripsi - RL and Ensemble/data/raw/home-credit-default-risk/previous_application.csv")
pos_cash = pd.read_csv("D:/Code Skripsi - RL and Ensemble/data/raw/home-credit-default-risk/POS_CASH_balance.csv")
installments = pd.read_csv("D:/Code Skripsi - RL and Ensemble/data/raw/home-credit-default-risk/installments_payments.csv")
credit_card = pd.read_csv("D:/Code Skripsi - RL and Ensemble/data/raw/home-credit-default-risk/credit_card_balance.csv")

In [4]:
# Display the head of each DataFrame
dataframes = [application_train, bureau, bureau_balance, previous_application, pos_cash, installments, credit_card]
dataframe_names = ['application_train', 'bureau', 'bureau_balance', 'previous_application', 'pos_cash', 'installments', 'credit_card']

for df, name in zip(dataframes, dataframe_names):
    print(f"DataFrame: {name}")
    display(df.head(1))
    print("\n")

DataFrame: application_train

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,AMT_GOODS_PRICE,NAME_TYPE_SUITE,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,DAYS_REGISTRATION,DAYS_ID_PUBLISH,OWN_CAR_AGE,FLAG_MOBIL,FLAG_EMP_PHONE,FLAG_WORK_PHONE,FLAG_CONT_MOBILE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,WEEKDAY_APPR_PROCESS_START,ORGANIZATION_TYPE,DAYS_LAST_PHONE_CHANGE
0,100002,1,Cash loans,N,Y,0,202500.0,406597.5,24700.5,351000.0,Unaccompanied,Working,Secondary / secondary special,Single / not married,House / apartment,-9461,-637,-3648.0,-2120,NaN,1,1,0,1,1,0,Laborers,1.0,WEDNESDAY,Business Entity,-1134.0

DataFrame: bureau

,SK_ID_CURR,SK_ID_BUREAU,CREDIT_ACTIVE,CREDIT_CURRENCY,DAYS_CREDIT,CREDIT_DAY_OVERDUE,DAYS_CREDIT_ENDDATE,DAYS_ENDDATE_FACT,AMT_CREDIT_MAX_OVERDUE,CNT_CREDIT_PROLONG,AMT_CREDIT_SUM,AMT_CREDIT_SUM_DEBT,AMT_CREDIT_SUM_LIMIT,AMT_CREDIT_SUM_OVERDUE,CREDIT_TYPE,DAYS_CREDIT_UPDATE,AMT_ANNUITY
0,215354,5714462,Closed,currency 1,-497,0,-153.0,-153.0,NaN,0,91323.0,0.0,NaN,0.0,Consumer credit,-131,NaN

DataFrame: bureau_balance

   SK_ID_BUREAU  MONTHS_BALANCE STATUS
0       5715448               0      C

DataFrame: previous_application

,SK_ID_PREV,SK_ID_CURR,NAME_CONTRACT_TYPE,AMT_ANNUITY,AMT_APPLICATION,AMT_CREDIT,AMT_DOWN_PAYMENT,AMT_GOODS_PRICE,WEEKDAY_APPR_PROCESS_START,HOUR_APPR_PROCESS_START,FLAG_LAST_APPL_PER_CONTRACT,NFLAG_LAST_APPL_IN_DAY,RATE_DOWN_PAYMENT,RATE_INTEREST_PRIMARY,RATE_INTEREST_PRIVILEGED,NAME_CASH_LOAN_PURPOSE,NAME_CONTRACT_STATUS,DAYS_DECISION,NAME_PAYMENT_TYPE,CODE_REJECT_REASON,NAME_TYPE_SUITE,NAME_CLIENT_TYPE,NAME_GOODS_CATEGORY,NAME_PORTFOLIO,NAME_PRODUCT_TYPE,CHANNEL_TYPE,SELLERPLACE_AREA,NAME_SELLER_INDUSTRY,CNT_PAYMENT,NAME_YIELD_GROUP,PRODUCT_COMBINATION,DAYS_FIRST_DRAWING,DAYS_FIRST_DUE,DAYS_LAST_DUE_1ST_VERSION,DAYS_LAST_DUE,DAYS_TERMINATION,NFLAG_INSURED_ON_APPROVAL
0,2030495,271877,Consumer loans,1730.43,17145.0,17145.0,0.0,17145.0,SATURDAY,15,Y,1,0.0,0.182832,0.867336,XAP,Approved,-73,Cash through the bank,XAP,NaN,Repeater,Mobile,POS,XNA,Country-wide,35,Connectivity,12.0,middle,POS mobile with interest,365243.0,-42.0,300.0,-42.0,-37.0,0.0

DataFrame: pos_cash

,SK_ID_PREV,SK_ID_CURR,MONTHS_BALANCE,CNT_INSTALMENT,CNT_INSTALMENT_FUTURE,NAME_CONTRACT_STATUS,SK_DPD,SK_DPD_DEF
0,1803195,182943,-31,48.0,45.0,Active,0,0

DataFrame: installments

,SK_ID_PREV,SK_ID_CURR,NUM_INSTALMENT_VERSION,NUM_INSTALMENT_NUMBER,DAYS_INSTALMENT,DAYS_ENTRY_PAYMENT,AMT_INSTALMENT,AMT_PAYMENT
0,1054186,161674,1.0,6,-1180.0,-1187.0,6948.36,6948.36

DataFrame: credit_card

,SK_ID_PREV,SK_ID_CURR,MONTHS_BALANCE,AMT_BALANCE,AMT_CREDIT_LIMIT_ACTUAL,AMT_DRAWINGS_ATM_CURRENT,AMT_DRAWINGS_CURRENT,AMT_DRAWINGS_OTHER_CURRENT,AMT_DRAWINGS_POS_CURRENT,AMT_INST_MIN_REGULARITY,AMT_PAYMENT_CURRENT,AMT_PAYMENT_TOTAL_CURRENT,AMT_RECEIVABLE_PRINCIPAL,AMT_RECIVABLE,AMT_TOTAL_RECEIVABLE,CNT_DRAWINGS_ATM_CURRENT,CNT_DRAWINGS_CURRENT,CNT_DRAWINGS_OTHER_CURRENT,CNT_DRAWINGS_POS_CURRENT,CNT_INSTALMENT_MATURE_CUM,NAME_CONTRACT_STATUS,SK_DPD,SK_DPD_DEF
0,2562384,378907,-6,56.97,135000,0.0,877.5,0.0,877.5,1700.325,1800.0,1800.0,0.0,0.0,0.0,0.0,1,0.0,1.0,35.0,Active,0,0

# Merge Dataset

In [ ]:
# bureau_agg = bureau.groupby('SK_ID_CURR').agg({
#     'SK_ID_BUREAU': 'count',
#     'AMT_CREDIT_SUM': ['sum', 'mean'],
#     'CREDIT_ACTIVE': lambda x: (x == 'Active').sum(),
# }).reset_index()
#
#
# bureau_agg.columns = ['SK_ID_CURR', 'NUM_BUREAU_LOANS', 'SUM_CREDIT', 'AVG_CREDIT', 'ACTIVE_LOANS']

In [5]:
# bureau dataset

# Aggregation per SK_ID_CURR
bureau_agg = bureau.groupby('SK_ID_CURR').agg({
    'SK_ID_BUREAU': 'count',  # Number of external loans
    'AMT_CREDIT_SUM': ['sum', 'mean'],  # Total and average credit
    'DAYS_CREDIT': ['min', 'max'],  # First and last recorded credit
    'CREDIT_ACTIVE': lambda x: (x == 'Active').sum(),  # Active loans count
}).reset_index()

# Rename columns
bureau_agg.columns = ['SK_ID_CURR', 'NUM_BUREAU_LOANS', 'SUM_CREDIT', 'AVG_CREDIT', 'FIRST_CREDIT_DAYS', 'LAST_CREDIT_DAYS', 'ACTIVE_LOANS']

In [6]:
bureau_agg.head()

,SK_ID_CURR,NUM_BUREAU_LOANS,SUM_CREDIT,AVG_CREDIT,FIRST_CREDIT_DAYS,LAST_CREDIT_DAYS,ACTIVE_LOANS
0,100001,7,1453365.000,207623.571429,-1572,-49,3
1,100002,8,865055.565,108131.945625,-1437,-103,2
2,100003,4,1017400.500,254350.125000,-2586,-606,1
3,100004,2,189037.800,94518.900000,-1326,-408,0
4,100005,3,657126.000,219042.000000,-373,-62,2

In [7]:
# Merge with main dataset
application_train = application_train.merge(bureau_agg, on='SK_ID_CURR', how='left')

In [ ]:
# bureau_balance_agg = bureau_balance.groupby('SK_ID_BUREAU').agg({
#     'STATUS': lambda x: (x.astype(str) > '0').sum()
# }).reset_index()
# bureau_balance_agg.columns = ['SK_ID_BUREAU', 'OVERDUE_MONTHS']
# bureau = bureau.merge(bureau_balance_agg, on='SK_ID_BUREAU', how='left')

In [8]:
# bureau_balance dataset

# Aggregate per loan (SK_ID_BUREAU)
bureau_balance_agg = bureau_balance.groupby('SK_ID_BUREAU').agg({
    'MONTHS_BALANCE': ['min', 'max'],  # First and last recorded month
    'STATUS': lambda x: (x.astype(str) > '0').sum()  # Overdue months count
}).reset_index()

# Rename columns
bureau_balance_agg.columns = ['SK_ID_BUREAU', 'FIRST_MONTH_BALANCE', 'LAST_MONTH_BALANCE', 'OVERDUE_MONTHS']

# Merge with bureau dataset
bureau = bureau.merge(bureau_balance_agg, on='SK_ID_BUREAU', how='left')

In [9]:
bureau_balance_agg.head()

   SK_ID_BUREAU  FIRST_MONTH_BALANCE  LAST_MONTH_BALANCE  OVERDUE_MONTHS
0       5001709                  -96                   0              97
1       5001710                  -82                   0              78
2       5001711                   -3                   0               1
3       5001712                  -18                   0               9
4       5001713                  -21                   0              22

In [ ]:
bureau_final_agg = bureau.groupby('SK_ID_CURR').agg({
    'OVERDUE_MONTHS': 'sum'
}).reset_index()

In [10]:
# Aggregate per SK_ID_CURR
bureau_final_agg = bureau.groupby('SK_ID_CURR').agg({
    'OVERDUE_MONTHS': 'sum',  # Total overdue months
    'FIRST_MONTH_BALANCE': 'min',  # First recorded month
    'LAST_MONTH_BALANCE': 'max',  # Last recorded month
}).reset_index()

In [11]:
# Merge with main dataset
application_train = application_train.merge(bureau_final_agg, on='SK_ID_CURR', how='left')

In [ ]:
previous_agg = previous_application.groupby('SK_ID_CURR').agg({
    'SK_ID_PREV': 'count',
    'AMT_CREDIT': ['sum', 'mean']
}).reset_index()
previous_agg.columns = ['SK_ID_CURR', 'NUM_PREV_LOANS', 'SUM_PREV_CREDIT', 'AVG_PREV_CREDIT']

In [12]:
# previous_application dataset

# Aggregate per SK_ID_CURR
previous_agg = previous_application.groupby('SK_ID_CURR').agg({
    'SK_ID_PREV': 'count',  # Number of previous loans
    'AMT_CREDIT': ['sum', 'mean'],  # Total and average credit
    'DAYS_DECISION': 'min',  # Most recent loan decision
}).reset_index()

# Rename columns
previous_agg.columns = ['SK_ID_CURR', 'NUM_PREV_LOANS', 'SUM_PREV_CREDIT', 'AVG_PREV_CREDIT']

In [ ]:
previous_agg = previous_application.groupby('SK_ID_CURR').agg({
    'SK_ID_PREV': 'count',
    'AMT_CREDIT': ['sum', 'mean'],
previous_agg.columns = ['SK_ID_CURR', 'NUM_PREV_LOANS', 'SUM_PREV_CREDIT', 'AVG_PREV_CREDIT']

In [13]:
previous_agg.head()

,SK_ID_CURR,NUM_PREV_LOANS,SUM_PREV_CREDIT,AVG_PREV_CREDIT,RECENT_LOAN_DAYS
0,100001,1,23787.0,23787.00,-1740
1,100002,1,179055.0,179055.00,-606
2,100003,3,1452573.0,484191.00,-2341
3,100004,1,20106.0,20106.00,-815
4,100005,2,40153.5,20076.75,-757

In [14]:
# Merge with main dataset
application_train = application_train.merge(previous_agg, on='SK_ID_CURR', how='left')

In [15]:
# POS_CASH_balance dataset

# Aggregate per SK_ID_PREV
pos_cash_agg = pos_cash.groupby('SK_ID_PREV').agg({
    'MONTHS_BALANCE': ['min', 'max'],  # First and last recorded month
}).reset_index()

# Fix Multi-Level Column Names
pos_cash_agg.columns = ['_'.join(col).strip() if isinstance(col, tuple) else col for col in pos_cash_agg.columns]

# Rename the key column properly
pos_cash_agg.rename(columns={'SK_ID_PREV_': 'SK_ID_PREV'}, inplace=True)

In [16]:
pos_cash_agg.head()

   SK_ID_PREV  MONTHS_BALANCE_min  MONTHS_BALANCE_max
0     1000001                 -10                  -8
1     1000002                 -54                 -50
2     1000003                  -4                  -1
3     1000004                 -29                 -22
4     1000005                 -56                 -46

In [ ]:
previous_application = previous_application.merge(pos_cash_agg, on='SK_ID_PREV', how='left')
pos_cash_final_agg = previous_application.groupby('SK_ID_CURR').agg({
    'MONTHS_BALANCE_min': 'min',
    'MONTHS_BALANCE_max': 'max',
}).reset_index()

In [17]:
# Merge with previous_application before aggregating per SK_ID_CURR
previous_application = previous_application.merge(pos_cash_agg, on='SK_ID_PREV', how='left')

# Aggregate per SK_ID_CURR
pos_cash_final_agg = previous_application.groupby('SK_ID_CURR').agg({
    'MONTHS_BALANCE_min': 'min',  # First recorded month
    'MONTHS_BALANCE_max': 'max',  # Last recorded month
}).reset_index()

In [18]:
# Merge with main dataset
application_train = application_train.merge(pos_cash_final_agg, on='SK_ID_CURR', how='left')

In [ ]:
installments_agg = installments.groupby('SK_ID_PREV').agg({
    'AMT_PAYMENT': 'mean',
}).reset_index()

In [19]:
# installments_payments dataset

# Aggregate per SK_ID_PREV
installments_agg = installments.groupby('SK_ID_PREV').agg({
    'AMT_PAYMENT': 'mean',  # Average installment payment
    'DAYS_ENTRY_PAYMENT': lambda x: (x > 0).sum()  # Count of late payments
}).reset_index()

In [20]:
installments_agg.head()

   SK_ID_PREV   AMT_PAYMENT  DAYS_ENTRY_PAYMENT
0     1000001  34221.712500                   0
1     1000002   9308.891250                   0
2     1000003   4951.350000                   0
3     1000004   4789.022143                   0
4     1000005  13365.609545                   0

In [ ]:
previous_application = previous_application.merge(installments_agg, on='SK_ID_PREV', how='left')
installments_final_agg = previous_application.groupby('SK_ID_CURR').agg({
    'AMT_PAYMENT': 'mean'
}).reset_index()

In [21]:
# Merge with previous_application
previous_application = previous_application.merge(installments_agg, on='SK_ID_PREV', how='left')

# Aggregate per SK_ID_CURR
installments_final_agg = previous_application.groupby('SK_ID_CURR').agg({
    'AMT_PAYMENT': 'mean',  # Average installment payment
    'DAYS_ENTRY_PAYMENT': 'sum'  # Total late payments
}).reset_index()

In [22]:
# Merge with main dataset
application_train = application_train.merge(installments_final_agg, on='SK_ID_CURR', how='left')

In [23]:
application_train.shape

(307511, 48)

In [24]:
kolom = [
    "AMT_INCOME_TOTAL",
    "AMT_CREDIT",
    "AMT_ANNUITY",
    "AMT_GOODS_PRICE",
    "SUM_CREDIT",
    "AVG_CREDIT",
    "SUM_PREV_CREDIT",
    "AVG_PREV_CREDIT",
    "AMT_PAYMENT",
]
application_train[kolom] = application_train[kolom] * 207.15

In [25]:
print(f"application_train shape: {application_train.shape}")
print(f"bureau shape: {bureau.shape}")
print(f"bureau_balance shape: {bureau_balance.shape}")
print(f"previous_application shape: {previous_application.shape}")
print(f"POS_CASH_balance shape: {pos_cash.shape}")
print(f"installments_payments shape: {installments.shape}")
print(f"credit_card_balance shape: {credit_card.shape}")

application_train shape: (307511, 48)
bureau shape: (1716428, 20)
bureau_balance shape: (27299925, 3)
previous_application shape: (1670214, 41)
POS_CASH_balance shape: (10001358, 8)
installments_payments shape: (13605401, 8)
credit_card_balance shape: (3840312, 23)

In [26]:
application_train.to_csv("merged_dataset.csv", index=False)